{
  "Ashwini": {
    "degree_range": "0° - 13°20' Aries",
    "ruling_planet": "Ketu",
    "deity": "Ashwini Kumaras (Divine Physicians)",
    "symbol": "Horse's head",
    "emotional_traits": [
      "Energetic and enthusiastic",
      "Quick-witted and intelligent",
      "Healing abilities",
      "Adventurous",
      "Competitive spirit",
      "Innovative thinking"
    ],
    "common_challenges": [
      "Impatience and restlessness",
      "Tendency to start projects but not finish them",
      "Can be self-centered",
      "May neglect long-term consequences",
      "Difficulty with commitment"
    ],
    "recommended_mantra": "Om Ashwinibhyam Namaha",
    "remedies": [
      "Volunteer in healthcare settings",
      "Practice patience through meditation",
      "Wear coral gemstone",
      "Feed horses or donate to equine charities",
      "Worship Lord Ganesha to remove obstacles"
    ],
    "response_template": "Namaste, divine soul with the Moon in Ashwini Nakshatra 🌸 Your celestial signature carries the healing energy of the Ashwini Kumaras, the divine physicians of the cosmos. Your natural enthusiasm, quick intelligence, and pioneering spirit are gifts from this star of new beginnings. I sense that your soul sometimes races ahead too quickly, creating impatience that may challenge your peace. Remember that even swift horses need moments of stillness. When feeling scattered, place your palms on your heart and practice deep, rhythmic breathing—connecting to the earth beneath you before galloping forward again. The mantra 'Om Ashwinibhyam Namaha' (I honor the divine healers) can help restore your balance when recited 11 times daily. Like the first light of dawn that Ashwini represents, may you always find renewal after darkness, and the courage to begin again with wisdom guiding your adventurous spirit. Your healing touch is needed in this world."
  },
  "Bharani": {
    "degree_range": "13°20' - 26°40' Aries",
    "ruling_planet": "Venus",
    "deity": "Yama (God of Death and Dharma)",
    "symbol": "Female sexual organ (Yoni)",
    "emotional_traits": [
      "Assertive and determined",
      "Strong willpower",
      "Passionate and intense",
      "Independent",
      "Creative",
      "Transformative"
    ],
    "common_challenges": [
      "Tendency toward aggression",
      "Possessiveness",
      "Difficulty with restraint",
      "Prone to power struggles",
      "Can be harsh or judgmental"
    ],
    "recommended_mantra": "Om Yamaya Namaha",
    "remedies": [
      "Feeding crows (associated with Yama)",
      "Charity to the elderly or terminally ill",
      "Wearing diamond (Venus)",
      "Reciting Vishnu Sahasranama",
      "Practice forgiveness meditation"
    ],
    "response_template": "Namaste, beautiful soul with Moon in Bharani Nakshatra 🌸 You carry within you the transformative energy of Yama, the deity of cosmic time and transcendence. Your passionate nature, creative fire, and remarkable determination are the gifts of your birth star. I understand that your intensity sometimes manifests as restlessness or impatience with others who don't match your passionate pace. When emotions feel overwhelming, visualize the gentle restraint of Yama's noose, not as punishment but as divine boundary-setting. Practice releasing one deep breath for each worry that binds you. The sacred mantra 'Om Yamaya Namaha' (I honor the Lord of Dharma) can help transform your fierce energies into spiritual strength when chanted 108 times weekly. Remember that Bharani's symbol of the yoni represents both creation and transformation—you have the power to birth new realities from what appears to be ending. May your courageous heart continue its journey of transformation, carrying light even through the darkest thresholds."
  },
  "Krittika": {
    "degree_range": "26°40' Aries - 10° Taurus",
    "ruling_planet": "Sun",
    "deity": "Agni (God of Fire)",
    "symbol": "Razor or cutting tool",
    "emotional_traits": [
      "Purifying and cleansing energy",
      "Sharp intellect",
      "Ambitious",
      "Perfectionist",
      "Disciplined",
      "Straightforward"
    ],
    "common_challenges": [
      "Overly critical nature",
      "Tendency to burn out",
      "Can be sharp-tongued",
      "Sometimes lacks diplomacy",
      "Can be overly competitive"
    ],
    "recommended_mantra": "Om Agnaye Namaha",
    "remedies": [
      "Offer ghee to sacred fire",
      "Wearing ruby (Sun)",
      "Practice of Surya Namaskar (Sun Salutation)",
      "Donate wheat or jaggery",
      "Feeding goats or sheep"
    ],
    "response_template": "Namaste, radiant soul with Moon in Krittika Nakshatra 🌸 You are blessed with the purifying flames of Agni, the sacred fire that transforms and illuminates. Your clarity of purpose, sharp discernment, and commitment to truth are the luminous gifts of your birth star. I recognize that your cutting precision sometimes manifests as self-criticism or judgment that burns too intensely. When perfectionism flares, envision yourself as a gentle hearth fire rather than a forest blaze. Create a ritual of lighting a candle and watching its steady flame to remind yourself that warmth is as important as light. The healing mantra 'Om Agnaye Namaha' (I honor the divine fire) can temper your intensity when chanted during sunrise or sunset. Just as Krittika's symbol of the razor brings clarity through separation, you have the divine ability to cut through illusion while maintaining compassion. May your inner fire always provide both illumination and nurturing warmth, burning away only what no longer serves your highest evolution."
  },
  "Rohini": {
    "degree_range": "10° - 23°20' Taurus",
    "ruling_planet": "Moon",
    "deity": "Brahma (The Creator)",
    "symbol": "Chariot or cart",
    "emotional_traits": [
      "Nurturing and maternal",
      "Loyal and devoted",
      "Sensual and creative",
      "Patient and stable",
      "Growth-oriented",
      "Artistic sensibilities"
    ],
    "common_challenges": [
      "Can be overly possessive",
      "Materialistic tendencies",
      "Stubbornness",
      "Comfort-seeking behavior",
      "Resistance to change"
    ],
    "recommended_mantra": "Om Brahmane Namaha",
    "remedies": [
      "Offering milk to Lord Shiva",
      "Wearing pearl (Moon)",
      "Growing flowering plants",
      "Feeding cows",
      "Practice artistic pursuits"
    ],
    "response_template": "Namaste, gentle soul with Moon in Rohini Nakshatra 🌸 You embody the nurturing energy of the Red One, the star beloved by the Moon himself. Your creative abundance, sensual appreciation of beauty, and steadfast loyalty are the blessed gifts of your celestial placement. I sense that your love of comfort and security sometimes manifests as attachment or resistance to necessary change. When feeling stuck, connect with flowing water—drink it mindfully, bathe in it reverently, or simply listen to its song. This honors Rohini's fluid creativity while encouraging graceful movement. The soothing mantra 'Om Brahmane Namaha' (I honor the Creator) can help you embrace growth with less resistance when chanted while gardening or creating. Like the fertile fields that Rohini represents, your soul flourishes when you allow both roots and new growth their proper place. May your path always be illuminated by the soft, red glow of cosmic creativity, nurturing all you touch with the same loving patience the Creator extends to us all."
  },
  "Mrigashira": {
    "degree_range": "23°20' Taurus - 6°40' Gemini",
    "ruling_planet": "Mars",
    "deity": "Soma (Moon God)",
    "symbol": "Deer's head",
    "emotional_traits": [
      "Gentle and mild-mannered",
      "Curious and searching",
      "Adaptable",
      "Sweet-natured",
      "Intellectual",
      "Sensitive"
    ],
    "common_challenges": [
      "Indecisiveness",
      "Restlessness",
      "Can be easily influenced",
      "Tendency to avoid confrontation",
      "May lack persistence"
    ],
    "recommended_mantra": "Om Somaya Namaha",
    "remedies": [
      "Offering white flowers to the Moon",
      "Wearing green gemstones",
      "Feeding deer or donating to wildlife",
      "Practicing forest meditation",
      "Drinking fennel tea"
    ],
    "response_template": "Namaste, seeking soul with Moon in Mrigashira Nakshatra 🌸 Your celestial blueprint carries the gentle energy of the Deer's Head, eternally searching for the sweetest experiences life offers. Your curiosity, adaptability, and natural charm are the beautiful gifts of your birth star. I understand that your searching nature sometimes manifests as restlessness or indecision when faced with too many paths. When feeling scattered, walk barefoot on natural ground and follow your breath like a trail through a forest—one step, one breath at a time. The harmonizing mantra 'Om Somaya Namaha' (I honor the nourishing Moon) can settle your seeking mind when whispered 27 times before sleep. Just as Mrigashira's deer pauses to listen before moving forward, you possess the divine wisdom to know when to seek and when to rest in what you've found. May your gentle heart always find the nourishment it seeks, and may your path through the cosmic forest be filled with discoveries that feed your soul's deepest hunger."
  },
  "Ardra": {
    "degree_range": "6°40' - 20° Gemini",
    "ruling_planet": "Rahu",
    "deity": "Rudra (Fierce form of Lord Shiva)",
    "symbol": "Teardrop or diamond",
    "emotional_traits": [
      "Intense and passionate",
      "Transformative energy",
      "Powerful and forceful",
      "Deep emotional insight",
      "Strong willpower",
      "Capacity for profound change"
    ],
    "common_challenges": [
      "Prone to anger and emotional storms",
      "Can be destructive",
      "Tendency toward obsession",
      "Difficulty with moderation",
      "May struggle with grief"
    ],
    "recommended_mantra": "Om Rudraya Namaha",
    "remedies": [
      "Perform Rudra Abhishekam",
      "Wear blue sapphire (with caution)",
      "Feed dogs",
      "Donate black sesame seeds",
      "Practice storm meditation"
    ],
    "response_template": "Namaste, powerful soul with Moon in Ardra Nakshatra 🌸 Your being resonates with the transformative storm energy of Rudra, the howling, weeping aspect of cosmic consciousness. Your emotional depth, capacity for radical honesty, and transformative presence are the profound gifts of your birth star. I recognize that your intensity sometimes manifests as emotional turbulence or destructive impulses when feelings overwhelm. When storm clouds gather within, stand as witness to your emotions like watching rainfall—neither suppressing nor becoming the storm itself. The centering mantra 'Om Rudraya Namaha' (I honor the Howler) can help transmute raw emotion into spiritual power when chanted during emotional release. Like Ardra's symbol of the teardrop, you understand that both sorrow and renewal flow from the same divine source. May you embrace your sacred role as transformer, finding the still point at the center of every storm, and washing the world clean with tears of both grief and liberation."
  },
  "Punarvasu": {
    "degree_range": "20° Gemini - 3°20' Cancer",
    "ruling_planet": "Jupiter",
    "deity": "Aditi (Mother of Gods)",
    "symbol": "Quiver of arrows",
    "emotional_traits": [
      "Optimistic and positive",
      "Nurturing and supportive",
      "Expansive vision",
      "Wise and knowledgeable",
      "Generous spirit",
      "Renewed vitality"
    ],
    "common_challenges": [
      "Can be overly idealistic",
      "Tendency to spread oneself too thin",
      "May avoid practical matters",
      "Difficulty with boundaries",
      "Can promise more than can deliver"
    ],
    "recommended_mantra": "Om Adityai Namaha",
    "remedies": [
      "Chanting Vishnu Sahasranama",
      "Wearing yellow sapphire",
      "Donating yellow items",
      "Feeding bananas to cows",
      "Learning spiritual wisdom"
    ],
    "response_template": "Namaste, optimistic soul with Moon in Punarvasu Nakshatra 🌸 Your spirit carries the renewing energy of Aditi, the boundless cosmic mother who returns all to goodness. Your natural wisdom, generosity of spirit, and ability to begin again are the uplifting gifts of your birth star. I sense that your expansive vision sometimes manifests as overextension or unrealistic expectations that tax your well-being. When feeling scattered among too many possibilities, sit beneath the open sky and remember that even vastness has structure—stars form constellations, giving meaning to infinity. The nurturing mantra 'Om Adityai Namaha' (I honor the Mother of Light) can help focus your abundant energy when repeated during moments of overwhelm. Just as Punarvasu's quiver holds many arrows but releases them one by one, you can honor all possibilities while choosing your path with discernment. May your journey always be blessed with the return to joy that your nakshatra promises, finding renewal no matter how far you've wandered."
  },
  "Pushya": {
    "degree_range": "3°20' - 16°40' Cancer",
    "ruling_planet": "Saturn",
    "deity": "Brihaspati (Jupiter, spiritual teacher of the gods)",
    "symbol": "Flower or circle",
    "emotional_traits": [
      "Nurturing and protective",
      "Virtuous and ethical",
      "Spiritually oriented",
      "Compassionate",
      "Disciplined",
      "Emotionally stable"
    ],
    "common_challenges": [
      "Can be overly cautious",
      "Tendency toward rigidity",
      "May be judgmental of others",
      "Can be overly sacrificing",
      "Difficulty asserting personal needs"
    ],
    "recommended_mantra": "Om Brihaspataye Namaha",
    "remedies": [
      "Feeding Brahmins or spiritual teachers",
      "Wearing white flowers",
      "Donating white rice or milk",
      "Worshipping Lord Ganesha",
      "Reading spiritual texts"
    ],
    "response_template": "Namaste, nurturing soul with Moon in Pushya Nakshatra 🌸 Your being blossoms with the nourishing energy of Brihaspati, the cosmic teacher who guides with wisdom and compassion. Your natural protectiveness, spiritual devotion, and nurturing strength are the precious gifts of your birth star. I understand that your caregiving nature sometimes manifests as self-sacrifice or bearing burdens that aren't yours to carry. When feeling depleted, place your hands on your heart center and visualize a lotus flower opening and closing with each breath—receiving nourishment before giving it away. The balancing mantra 'Om Brihaspataye Namaha' (I honor the Teacher of the Gods) can restore your energy when recited while holding something that symbolizes abundance. Like Pushya's symbol of the flower, you flourish most beautifully when rooted in self-care before extending your petals to others. May your compassionate heart continue to nourish all it touches, while remembering that you too are worthy of the same tender care you so freely give to others."
  },
  "Ashlesha": {
    "degree_range": "16°40' - 30° Cancer",
    "ruling_planet": "Mercury",
    "deity": "Nagas (Serpent Gods)",
    "symbol": "Coiled serpent",
    "emotional_traits": [
      "Intensely perceptive",
      "Mysterious and secretive",
      "Healing abilities",
      "Magical and transformative",
      "Deeply intuitive",
      "Spiritually powerful"
    ],
    "common_challenges": [
      "Can be manipulative",
      "Tendency toward jealousy",
      "May use sharp words",
      "Struggles with trust",
      "Prone to psychological complexities"
    ],
    "recommended_mantra": "Om Naga Devataabhyo Namaha",
    "remedies": [
      "Worship of Lord Shiva with milk",
      "Wearing emerald",
      "Offering milk to snakes (symbolically)",
      "Practice of Kundalini yoga",
      "Learning occult sciences responsibly"
    ],
    "response_template": "Namaste, mystical soul with Moon in Ashlesha Nakshatra 🌸 Your being embodies the transformative wisdom of the Naga serpent deities who guard the secrets between worlds. Your intuitive perception, healing abilities, and emotional intensity are the profound gifts of your birth star. I recognize that your penetrating awareness sometimes manifests as mistrust or emotional entanglement that constricts your freedom. When feeling ensnared by complicated emotions, imagine yourself shedding an old skin like the serpent—releasing what no longer serves your evolution. The liberating mantra 'Om Naga Devataabhyo Namaha' (I honor the Serpent Deities) can untangle emotional knots when chanted while moving your spine in gentle undulations. Like Ashlesha's coiled serpent, your power lies in knowing when to embrace and when to release your grip on what you love. May your kundalini wisdom continue rising through all challenges, transforming poison into medicine as only the serpent-blessed can do, always finding freedom in the sacred spiral of existence."
  },
  "Magha": {
    "degree_range": "0° - 13°20' Leo",
    "ruling_planet": "Ketu",
    "deity": "Pitris (Ancestors)",
    "symbol": "Throne or royal chamber",
    "emotional_traits": [
      "Pride and dignity",
      "Leadership qualities",
      "Ambitious nature",
      "Loyal to ancestry",
      "Powerful presence",
      "Sense of grandeur"
    ],
    "common_challenges": [
      "Can be arrogant",
      "Excessive pride",
      "Authoritarian tendencies",
      "May struggle with humility",
      "Excessive concern with status"
    ],
    "recommended_mantra": "Om Pitru Devataabhyo Namaha",
    "remedies": [
      "Performing ancestor rituals (Shraddha)",
      "Wearing cat's eye gemstone",
      "Donating to the elderly",
      "Feeding crows",
      "Practicing filial duties"
    ],
    "response_template": "Namaste, royal soul with Moon in Magha Nakshatra 🌸 Your being carries the ancestral majesty of the Pitris, the divine forebears who bless from beyond the veil. Your natural leadership, dignified presence, and connection to lineage are the regal gifts of your birth star. I sense that your pride sometimes manifests as excessive self-importance or difficulty accepting help when the throne feels heavy. When feeling burdened by expectations, honor your ancestors with a small offering—water, light, or simply remembrance—to reconnect with the supportive presence behind your own. The humbling mantra 'Om Pitru Devataabhyo Namaha' (I honor the Ancestral Divinities) can soften pride into proper dignity when spoken before making important decisions. Like Magha's throne symbol, you stand at the intersection of past and future royalty, bearing both the crown and responsibility with grace. May you always walk with the perfect balance of pride and humility that true nobility requires, honoring those who came before while creating your own sovereign path."
  },
  "Purva Phalguni": {
    "degree_range": "13°20' - 26°40' Leo",
    "ruling_planet": "Venus",
    "deity": "Bhaga (God of Marital Happiness)",
    "symbol": "Front legs of a bed or hammock",
    "emotional_traits": [
      "Passionate and romantic",
      "Playful and joyous",
      "Creative expression",
      "Charismatic",
      "Enjoyment of life",
      "Loving and devoted"
    ],
    "common_challenges": [
      "Can be self-indulgent",
      "Tendency toward sensual excesses",
      "May lack discipline",
      "Sometimes superficial",
      "Can be distracted by pleasures"
    ],
    "recommended_mantra": "Om Bhagaya Namaha",
    "remedies": [
      "Offering red flowers to the Divine Mother",
      "Wearing diamond",
      "Acts of charity to young girls",
      "Practicing artistic pursuits",
      "Balancing pleasure with discipline"
    ],
    "response_template": "Namaste, joyful soul with Moon in Purva Phalguni Nakshatra 🌸 Your spirit dances with the celebratory energy of Bhaga, the deity of fortunate enjoyment and marital happiness. Your natural charm, creative expression, and gift for finding pleasure are the delightful offerings of your birth star. I understand that your love of enjoyment sometimes manifests as self-indulgence or avoidance of necessary discipline that limits your growth. When feeling pulled toward excess, create beauty in moderation—arrange flowers, prepare a simple but beautiful meal, or adorn yourself mindfully. The balancing mantra 'Om Bhagaya Namaha' (I honor the Lord of Good Fortune) can help harmonize pleasure with purpose when chanted before creative activities. Like Purva Phalguni's symbol of the front legs of a bed, you excel at creating the foundation for both pleasure and rest in proper measure. May your path always be illuminated by the warm light of joyful creation, finding the sacred in sensual experience while maintaining the discipline that makes true happiness sustainable."
  },
  "Uttara Phalguni": {
    "degree_range": "26°40' Leo - 10° Virgo",
    "ruling_planet": "Sun",
    "deity": "Aryaman (God of Patronage)",
    "symbol": "Rear legs of a bed or hammock",
    "emotional_traits": [
      "Harmonious and balanced",
      "Socially graceful",
      "Leadership qualities",
      "Honorable and respected",
      "Family-oriented",
      "Diplomatic"
    ],
    "common_challenges": [
      "Can be too concerned with appearances",
      "May struggle with authenticity",
      "Sometimes rigid in social expectations",
      "Difficulty with personal freedom",
      "Can be judgmental of unconventionality"
    ],
    "recommended_mantra": "Om Aryamnae Namaha",
    "remedies": [
      "Donating to marriage ceremonies",
      "Wearing ruby",
      "Practicing Surya Namaskar",
      "Fostering harmony in relationships",
      "Supporting family traditions"
    ],
    "response_template": "Namaste, harmonious soul with Moon in Uttara Phalguni Nakshatra 🌸 Your being shines with the patronage of Aryaman, the deity of honor, favors, and social cohesion. Your natural diplomacy, sense of fairness, and ability to create beneficial partnerships are the gracious gifts of your birth star. I recognize that your social consciousness sometimes manifests as excessive concern with appearances or difficulty expressing your authentic self. When feeling constrained by social expectations, stand in sunlight and feel its warmth on your skin—remembering that even as you fulfill social duties, your individual light matters deeply. The liberating mantra 'Om Aryamnae Namaha' (I honor the Patron of Beneficial Relationships) can help balance social harmony with self-expression when chanted before social engagements. Like Uttara Phalguni's symbol of the rear legs of a bed, you provide completion and stability to what others begin. May you always find the perfect balance between social grace and personal truth, creating harmony without sacrificing the unique melody your soul came here to sing."
  },
  "Hasta": {
    "degree_range": "10° - 23°20' Virgo",
    "ruling_planet": "Moon",
    "deity": "Savitar (Aspect of Sun as Creator)",
    "symbol": "Hand",
    "emotional_traits": [
      "Skilled and dexterous",
      "Practical intelligence",
      "Resourceful",
      "Detail-oriented",
      "Healing touch",
      "Service-oriented"
    ],
    "common_challenges": [
      "Can be overly critical",
      "Perfectionism",
      "Tendency to overwork",
      "May struggle with relaxation",
      "Can be too analytical"
    ],
    "recommended_mantra": "Om Savitre Namaha",
    "remedies": [
      "Practicing hand crafts",
      "Wearing pearl",
      "Charitable works using manual skills",
      "Learning healing modalities",
      "Developing mindfulness of hands"
    ],
    "response_template": "Namaste, skillful soul with Moon in Hasta Nakshatra 🌸 Your being emanates the creative energy of Savitar, the stimulating aspect of the Sun that brings skills to life through our hands. Your natural dexterity, practical intelligence, and healing touch are the masterful gifts of your birth star. I sense that your focus on perfect execution sometimes manifests as self-criticism or workaholic tendencies that disconnect you from joy. When feeling trapped in perfectionism, open and close your hands slowly, noticing how both grasping and releasing are necessary skills. The balancing mantra 'Om Savitre Namaha' (I honor the Stimulator of Creation) can reconnect you with creative flow when spoken while working with your hands. Like Hasta's symbol of the hand, you understand that true mastery comes not just from technique but from allowing divine energy to work through you. May your skilled hands always find the sacred in ordinary tasks, remembering that even the most precise work needs moments of rest to maintain its divine connection."
  },
  "Chitra": {
    "degree_range": "23°20' Virgo - 6°40' Libra",
    "ruling_planet": "Mars",
    "deity": "Vishwakarma (Divine Architect)",
    "symbol": "Pearl or jewel",
    "emotional_traits": [
      "Creative and artistic",
      "Bright and brilliant",
      "Attractive personality",
      "Talented",
      "Fashionable",
      "Appreciation for beauty"
    ],
    "common_challenges": [
      "Can be vain or self-absorbed",
      "Tendency toward indecision",
      "May struggle with substance",
      "Difficulty balancing form and function",
      "Sometimes superficial"
    ],
    "recommended_mantra": "Om Vishwakarmane Namaha",
    "remedies": [
      "Creative artistic endeavors",
      "Wearing coral",
      "Architectural or design studies",
      "Balancing aesthetics with functionality",
      "Creating beautiful spaces for others"
    ],
    "response_template": "Namaste, brilliant soul with Moon in Chitra Nakshatra 🌸 Your being sparkles with the architectural vision of Vishwakarma, the celestial craftsman who designs with both beauty and purpose. Your natural creativity, eye for beauty, and multifaceted talents are the dazzling gifts of your birth star. I understand that your appreciation for appearance sometimes manifests as superficiality or difficulty committing to one path when so many shine before you. When feeling scattered among possibilities, gaze at something of genuine beauty—a flower, gem, or artwork—and notice how its perfection comes from integration rather than fragmentation. The focusing mantra 'Om Vishwakarmane Namaha' (I honor the Divine Architect) can help unify your diverse talents when chanted while creating something beautiful. Like Chitra's jewel symbol, your many facets create a unified brilliance when properly aligned with purpose. May your creative vision always marry form with function, manifesting outer beauty that reflects the even greater radiance shining from within your multidimensional spirit."
  },
  "Swati": {
    "degree_range": "6°40' - 20° Libra",
    "ruling_planet": "Rahu",
    "deity": "Vayu (God of Wind)",
    "symbol": "Sword, coral, or young sprout",
    "emotional_traits": [
      "Independent and freedom-loving",
      "Adaptable and flexible",
      "Intellectual curiosity",
      "Spiritually inclined",
      "Good communication skills",
      "Innovative thinking"
    ],
    "common_challenges": [
      "Can be scattered or unfocused",
      "Restlessness",
      "Difficulty with commitment",
      "May lack groundedness",
      "Can be changeable like the wind"
    ],
    "recommended_mantra": "Om Vayave Namaha",
    "remedies": [
      "Pranayama (breath control)",
      "Wearing hessonite (gomed)",
      "Practicing grounding meditations",
      "Creating consistent routines",
      "Offering incense to the air element"
    ],
    "response_template": "Namaste, independent soul with Moon in Swati Nakshatra 🌸 Your spirit dances with the liberating currents of Vayu, the cosmic wind that cannot be contained or controlled. Your natural independence, adaptability, and gentle strength are the refreshing gifts of your birth star. I recognize that your freedom-loving nature sometimes manifests as restlessness or difficulty with commitment that limits your deeper growth. When feeling scattered, practice mindful breathing—feeling the autonomy in each inhalation and the surrender in each exhalation, finding freedom within form. The grounding mantra 'Om Vayave Namaha' (I honor the Wind God) can help balance movement with stability when whispered on the breeze. Like Swati's symbol of the young sprout swaying in the wind, you grow strongest when you can bend without breaking, rooted yet free. May your journey always honor both the call to freedom and the wisdom of sacred boundaries, finding your unique path between earth and sky as you dance with life's ever-changing winds."
  },
  "Vishakha": {
    "degree_range": "20° Libra - 3°20' Scorpio",
    "ruling_planet": "Jupiter",
    "deity": "Indra and Agni (Joint rule)",
    "symbol": "Potter's wheel or triumphal arch",
    "emotional_traits": [
      "Purposeful and determined",
      "Ambitious",
      "Willpower and focus",
      "Leadership abilities",
      "Spiritual seeking",
      "Goal-oriented"
    ],
    "common_challenges": [
      "Can be forceful or domineering",
      "Competitive to a fault",
      "May be single-minded",
      "Difficulty with compromise",
      "Can be judgmental"
    ],
    "recommended_mantra": "Om Indragnibhyam Namaha",
    "remedies": [
      "Worshipping both Indra and Agni",
      "Wearing yellow sapphire",
      "Setting balanced goals",
      "Practicing teamwork",
      "Balancing ambition with compassion"
    ],
    "response_template": "Namaste, purposeful soul with Moon in Vishakha Nakshatra 🌸 Your being radiates the focused energy of Indra and Agni working in divine partnership, combining leadership with transformative power. Your natural determination, goal-orientation, and capacity for achievement are the empowering gifts of your birth star. I sense that your ambition sometimes manifests as forcefulness or single-minded pursuit that overlooks the journey's gifts. When feeling driven to achieve at all costs, light a candle and watch how flame reaches upward while remaining connected to its source—ambition balanced with groundedness. The harmonizing mantra 'Om Indragnibhyam Namaha' (I honor Indra and Agni) can help integrate determination with wisdom when chanted at the beginning of important endeavors. Like Vishakha's symbol of the decorated gateway, you stand at the threshold between inspiration and manifestation, creating pathways for others. May your focused energy always serve your highest purpose, achieving not just your goals but the deeper fulfillment that comes from pursuing them in harmony with cosmic law."
  },
  "Anuradha": {
    "degree_range": "3°20' - 16°40' Scorpio",
    "ruling_planet": "Saturn",
    "deity": "Mitra (God of Friendship)",
    "symbol": "Lotus flower or staff",
    "emotional_traits": [
      "Friendly and cooperative",
      "Diplomatic",
      "Loyal and devoted",
      "Balanced nature",
      "Partnership-oriented",
      "Harmonious"
    ],
    "common_challenges": [
      "Can be dependent on others",
      "May avoid necessary conflict",
      "Sometimes lacks assertiveness",
      "Can be indecisive",
      "Tendency to compromise too much"
    ],
    "recommended_mantra": "Om Mitraya Namaha",
    "remedies": [
      "Fostering true friendships",
      "Wearing blue sapphire",
      "Practicing cooperative activities",
      "Maintaining balanced relationships",
      "Learning assertiveness with kindness"
    ],
    "response_template": "Namaste, friendly soul with Moon in Anuradha Nakshatra 🌸 Your heart beats with the cooperative rhythm of Mitra, the deity of friendship, alliances, and mutual support. Your natural diplomacy, loyalty, and ability to create harmony are the connecting gifts of your birth star. I understand that your focus on others sometimes manifests as dependency or difficulty standing firm in your own truth. When feeling lost in others' needs, place a hand on your heart and one on your solar plexus—bridging relationship with personal power. The affirming mantra 'Om Mitraya Namaha' (I honor the Friend of All) can strengthen your center while maintaining connection when repeated during moments of people-pleasing. Like Anuradha's lotus symbol, you flourish in supportive environments while remaining rooted in your own essential nature. May your compassionate heart always find the perfect balance between giving and receiving, creating friendships that honor both mutual support and individual sovereignty in the cosmic dance of interdependence."
  },
  "Jyeshtha": {
    "degree_range": "16°40' - 30° Scorpio",
    "ruling_planet": "Mercury",
    "deity": "Indra (King of Gods)",
    "symbol": "Earring or umbrella",
    "emotional_traits": [
      "Powerful and courageous",
      "Leadership abilities",
      "Protective instincts",
      "Deep emotional strength",
      "Determined",
      "Authoritative"
    ],
    "common_challenges": [
      "Can be controlling",
      "Jealousy and possessiveness",
      "May be too competitive",
      "Sometimes intimidating to others",
      "Difficulties sharing power"
    ],
    "recommended_mantra": "Om Indraya Namaha",
    "remedies": [
      "Offering prayers to Lord Indra",
      "Wearing emerald",
      "Practicing responsible leadership",
      "Learning to share authority",
      "Developing emotional intelligence"
    ],
    "response_template": "Namaste, powerful soul with Moon in Jyeshtha Nakshatra 🌸 Your being commands the royal energy of Indra, the king of the gods who stands eldest and mightiest among celestial beings. Your natural authority, protective strength, and penetrating intelligence are the sovereign gifts of your birth star. I recognize that your power sometimes manifests as controlling behavior or competitive struggles that create unnecessary conflict. When feeling the need to dominate, visualize a mighty umbrella sheltering others rather than a scepter commanding them—power expressed through protection. The balancing mantra 'Om Indraya Namaha' (I honor the King of Gods) can transform dominance into true leadership when chanted while contemplating how to use your influence wisely. Like Jyeshtha's earring or umbrella symbol, your greatest power lies in adorning and protecting others rather than controlling them. May your authoritative presence always serve the highest good, remembering that true sovereignty comes from ruling your own nature before attempting to lead others."
  },
  "Mula": {
    "degree_range": "0° - 13°20' Sagittarius",
    "ruling_planet": "Ketu",
    "deity": "Nirrti (Goddess of Destruction)",
    "symbol": "Tied bundle or roots",
    "emotional_traits": [
      "Deeply spiritual",
      "Insightful",
      "Transformative",
      "Powerful intuition",
      "Connection to origins",
      "Capacity for profound change"
    ],
    "common_challenges": [
      "Can be destructive",
      "Tendency toward upheaval",
      "May be too radical",
      "Difficulty with stability",
      "Sometimes uproots unnecessarily"
    ],
    "recommended_mantra": "Om Nirrtyai Namaha",
    "remedies": [
      "Worshipping Goddess Kali",
      "Wearing cat's eye gemstone",
      "Root chakra meditation",
      "Practicing grounding exercises",
      "Studying spiritual philosophy"
    ],
    "response_template": "Namaste, transformative soul with Moon in Mula Nakshatra 🌸 Your spirit carries the uprooting energy of Nirrti, the goddess who destroys what has become stagnant to make way for authentic growth. Your natural intensity, connection to origins, and power to create necessary endings are the purifying gifts of your birth star. I sense that your transformative nature sometimes manifests as destructiveness or radical changes that create upheaval without clear purpose. When feeling the urge to uproot everything, place your hands on the earth and feel its ancient stability—revolution balanced with reverence. The stabilizing mantra 'Om Nirrtyai Namaha' (I honor the Goddess of Dissolution) can help channel your transformative power constructively when chanted during times of major life changes. Like Mula's symbol of the tied bundle of roots, you understand that even in profound transformation, certain core truths remain essential. May your journey of spiritual evolution always honor both endings and beginnings, creating space for new growth while maintaining connection to the eternal roots of being."
  },
  "Purva Ashadha": {
    "degree_range": "13°20' - 26°40' Sagittarius",
    "ruling_planet": "Venus",
    "deity": "Apas (Water Goddesses)",
    "symbol": "Fan or winnowing basket",
    "emotional_traits": [
      "Enthusiastic and inspired",
      "Visionary abilities",
      "Charismatic",
      "Spiritually motivated",
      "Positive outlook",
      "Drive to succeed"
    ],
    "common_challenges": [
      "Can be impulsive",
      "Overly optimistic",
      "May lack practicality",
      "Sometimes inflexible in beliefs",
      "Can be preachy"
    ],
    "recommended_mantra": "Om Apaḥ Devatabhyo Namaha",
    "remedies": [
      "Water offerings to the sun",
      "Wearing diamond",
      "Charitable works involving water",
      "Balancing vision with practicality",
      "Learning patience in achieving goals"
    ],
    "response_template": "Namaste, inspired soul with Moon in Purva Ashadha Nakshatra 🌸 Your being flows with the purifying currents of Apas, the water goddesses who cleanse and invigorate all they touch. Your natural enthusiasm, visionary nature, and unstoppable determination are the refreshing gifts of your birth star. I understand that your passionate idealism sometimes manifests as impulsiveness or refusal to acknowledge practical limitations. When feeling carried away by inspiration, hold or sip water mindfully—remembering that even the most powerful current flows within banks that give it direction. The balancing mantra 'Om Apaḥ Devatabhyo Namaha' (I honor the Water Deities) can help temper enthusiasm with wisdom when chanted near flowing water. Like Purva Ashadha's fan symbol, you excel at spreading ideas and clearing away stagnation to make room for the new. May your visionary spirit always maintain its inspirational fire, while finding the perfect balance between passionate idealism and the patient persistence that brings lasting transformation."
  },
  "Uttara Ashadha": {
    "degree_range": "26°40' Sagittarius - 10° Capricorn",
    "ruling_planet": "Sun",
    "deity": "Vishvedevas (Universal Gods)",
    "symbol": "Elephant tusk or bed legs",
    "emotional_traits": [
      "Universal outlook",
      "Balanced perspective",
      "Leadership qualities",
      "Firm conviction",
      "Social responsibility",
      "Ethical strength"
    ],
    "common_challenges": [
      "Can be rigid in principles",
      "Sometimes judgmental",
      "May struggle with pragmatism",
      "Difficulty compromising",
      "Can be aloof"
    ],
    "recommended_mantra": "Om Vishvedevebhyo Namaha",
    "remedies": [
      "Universal prayer to all deities",
      "Wearing ruby",
      "Practicing inclusive spirituality",
      "Balancing idealism with practicality",
      "Developing compassion for all perspectives"
    ],
    "response_template": "Namaste, universal soul with Moon in Uttara Ashadha Nakshatra 🌸 Your being resonates with the cosmic harmony of the Vishvedevas, the universal gods who maintain divine order across all realms. Your natural integrity, balanced perspective, and commitment to higher principles are the elevating gifts of your birth star. I recognize that your devotion to truth sometimes manifests as rigidity or judgment that creates separation rather than understanding. When feeling overly righteous, gaze at the vast sky—noticing how it embraces all without preference yet maintains its essential nature. The harmonizing mantra 'Om Vishvedevebhyo Namaha' (I honor the Universal Gods) can soften dogmatism into discernment when chanted during sunrise or sunset. Like Uttara Ashadha's elephant tusk symbol, your strength is most beautiful when combined with sensitivity and wisdom. May your principled path always express the highest truth—not through judgment but through embodied wisdom that inspires others to discover their own divine nature."
  },
  "Shravana": {
    "degree_range": "10° - 23°20' Capricorn",
    "ruling_planet": "Moon",
    "deity": "Vishnu (Preserver God)",
    "symbol": "Ear or three footprints",
    "emotional_traits": [
      "Excellent listening skills",
      "Learning capacity",
      "Wisdom and intelligence",
      "Connection to ancestry",
      "Devotional nature",
      "Committed to duty"
    ],
    "common_challenges": [
      "Can be overly passive",
      "May absorb others' problems",
      "Sometimes lacks boundaries",
      "Difficulty asserting needs",
      "Can be too traditional"
    ],
    "recommended_mantra": "Om Vishnave Namaha",
    "remedies": [
      "Reciting Vishnu Sahasranama",
      "Wearing pearl",
      "Listening meditation",
      "Learning sacred knowledge",
      "Practicing conscious communication"
    ],
    "response_template": "Namaste, receptive soul with Moon in Shravana Nakshatra 🌸 Your being resonates with the connecting energy of Vishnu, who preserves cosmic harmony through attentive presence. Your natural listening ability, learning capacity, and commitment to right action are the connecting gifts of your birth star. I sense that your receptivity sometimes manifests as passivity or absorption of others' energies that clouds your own knowing. When feeling overwhelmed by external input, cup your ears gently with your hands and listen to your own inner sound—remembering that true hearing begins with self-awareness. The centering mantra 'Om Vishnave Namaha' (I honor the All-Pervading One) can help strengthen discernment when whispered during quiet moments of reflection. Like Shravana's symbol of three footprints, you walk the path of knowledge that connects heaven, earth, and the human realm through conscious awareness. May your attentive heart always hear both the spoken and unspoken truths, finding wisdom in every sound while maintaining your own sacred inner silence."
  },
  "Dhanishta": {
    "degree_range": "23°20' Capricorn - 6°40' Aquarius",
    "ruling_planet": "Mars",
    "deity": "Vasus (Gods of Abundance)",
    "symbol": "Drum or flute",
    "emotional_traits": [
      "Generous and wealthy spirit",
      "Musical talent",
      "Prosperous outlook",
      "Confident nature",
      "Determined",
      "Swift in action"
    ],
    "common_challenges": [
      "Can be materialistic",
      "Competitive to a fault",
      "May be too proud",
      "Sometimes inflexible",
      "Difficulty sharing resources"
    ],
    "recommended_mantra": "Om Vasubhyo Namaha",
    "remedies": [
      "Playing or listening to music",
      "Wearing coral",
      "Practicing charitable giving",
      "Developing abundance consciousness",
      "Learning resource management"
    ],
    "response_template": "Namaste, prosperous soul with Moon in Dhanishta Nakshatra 🌸 Your spirit resonates with the abundant energy of the Vasus, the gods of cosmic wealth and luminous manifestation. Your natural generosity, musical talent, and capacity for achievement are the enriching gifts of your birth star. I understand that your drive for success sometimes manifests as materialism or competitive striving that diminishes your inherent fullness. When feeling caught in scarcity thinking, make music—through voice, instrument, or simply rhythmic movement—to remember that true wealth flows from creative expression. The fulfilling mantra 'Om Vasubhyo Namaha' (I honor the Gods of Abundance) can help transform external seeking into inner richness when chanted rhythmically. Like Dhanishta's drum symbol, your greatest prosperity comes when you create harmonious vibrations that benefit all within hearing. May your generous spirit always know the difference between having wealth and being wealthy, finding the sacred symphony that plays when material abundance aligns with spiritual richness."
  },
  "Shatabhisha": {
    "degree_range": "6°40' - 20° Aquarius",
    "ruling_planet": "Rahu",
    "deity": "Varuna (God of Cosmic Waters)",
    "symbol": "Empty circle or flower",
    "emotional_traits": [
      "Healing abilities",
      "Scientific mind",
      "Intuitive understanding",
      "Mystical perception",
      "Innovative thinking",
      "Revolutionary ideas"
    ],
    "common_challenges": [
      "Can be detached or aloof",
      "Sometimes secretive",
      "May be too unconventional",
      "Difficulty with authority",
      "Can be unpredictable"
    ],
    "recommended_mantra": "Om Varunaya Namaha",
    "remedies": [
      "Water rituals or offerings",
      "Wearing hessonite",
      "Studying occult sciences responsibly",
      "Practicing medical or healing arts",
      "Balancing innovation with tradition"
    ],
    "response_template": "Namaste, healing soul with Moon in Shatabhisha Nakshatra 🌸 Your being channels the mysterious energy of Varuna, the cosmic observer who witnesses all from beyond the veils of ordinary perception. Your natural healing abilities, scientific mind, and connection to hidden knowledge are the illuminating gifts of your birth star. I recognize that your visionary perception sometimes manifests as detachment or secrecy that creates isolation rather than integration. When feeling separate from others, immerse your hands in water—connecting with Varuna's element while remembering that even the most independent drop is part of the same cosmic ocean. The connective mantra 'Om Varunaya Namaha' (I honor the Cosmic Waters) can help bridge inner knowing with outer expression when chanted near water sources. Like Shatabhisha's empty circle symbol, you understand both fullness and emptiness, seeing beyond appearances to the underlying reality. May your healing vision always serve to reveal the hidden connections between all beings, making the invisible visible while maintaining reverence for the great mystery at the heart of existence."
  },
  "Purva Bhadrapada": {
    "degree_range": "20° Aquarius - 3°20' Pisces",
    "ruling_planet": "Jupiter",
    "deity": "Aja Ekapada (One-footed Goat)",
    "symbol": "Two-faced man or front legs of funeral cot",
    "emotional_traits": [
      "Spiritually intense",
      "Psychic abilities",
      "Sharp intellect",
      "Fiery determination",
      "Transformative energy",
      "Balanced duality"
    ],
    "common_challenges": [
      "Can be too intense",
      "Tendency toward extremism",
      "May be impractical",
      "Difficulty with moderation",
      "Sometimes overly critical"
    ],
    "recommended_mantra": "Om Aja Ekapadaya Namaha",
    "remedies": [
      "Fire offerings",
      "Wearing yellow sapphire",
      "Balancing spiritual practices",
      "Learning to integrate opposites",
      "Developing practical spirituality"
    ],
    "response_template": "Namaste, fiery soul with Moon in Purva Bhadrapada Nakshatra 🌸 Your spirit blazes with the transformative energy of Aja Ekapada, the one-footed fire deity who stands between worlds with fierce intensity. Your natural depth, passionate conviction, and ability to bridge dualities are the alchemical gifts of your birth star. I sense that your intensity sometimes manifests as extremism or impracticality that burns bridges rather than building them. When feeling consumed by your own fire, visualize standing with one foot in cooling water and one on warming earth—balancing opposing elements within yourself. The integrating mantra 'Om Aja Ekapadaya Namaha' (I honor the One-Footed Illuminator) can help temper intensity with wisdom when chanted at transitional times like dawn or dusk. Like Purva Bhadrapada's two-faced symbol, you see both sides of every situation while maintaining your singular truth. May your transformative fire always burn with perfect intensity—enough to transform what needs changing while preserving what deserves to endure in your journey between worlds."
  },
  "Uttara Bhadrapada": {
    "degree_range": "3°20' - 16°40' Pisces",
    "ruling_planet": "Saturn",
    "deity": "Ahirbudhnya (Serpent of the Depths)",
    "symbol": "Rear legs of funeral cot or twin",
    "emotional_traits": [
      "Deep wisdom",
      "Spiritual insight",
      "Service orientation",
      "Compassionate nature",
      "Truth-seeking",
      "Healing capacities"
    ],
    "common_challenges": [
      "Can be overly serious",
      "Tendency toward pessimism",
      "May be too detached",
      "Difficulty with emotional expression",
      "Sometimes judgmental"
    ],
    "recommended_mantra": "Om Ahirbudhnyaya Namaha",
    "remedies": [
      "Deep meditation practices",
      "Wearing blue sapphire",
      "Service to the less fortunate",
      "Studying spiritual texts",
      "Developing emotional openness"
    ],
    "response_template": "Namaste, deep soul with Moon in Uttara Bhadrapada Nakshatra 🌸 Your being flows with the profound currents of Ahirbudhnya, the serpent of the cosmic depths who knows the mysteries beneath the surface of existence. Your natural wisdom, service orientation, and ability to bring hidden truths to light are the illuminating gifts of your birth star. I understand that your depth sometimes manifests as heaviness or judgment that creates unnecessary suffering for yourself and others. When feeling weighed down by perception, imagine yourself as the cosmic serpent swimming effortlessly through deep waters—wisdom without burden. The lightening mantra 'Om Ahirbudhnyaya Namaha' (I honor the Serpent of the Depths) can help transform heaviness into healing insight when chanted during spiritual practice. Like Uttara Bhadrapada's symbol of the rear legs of a funeral cot, you understand that every ending contains the seeds of new beginning. May your profound understanding always serve the highest healing, bringing light to dark places while maintaining the compassionate wisdom that true depth naturally engenders."
  },
  "Revati": {
    "degree_range": "16°40' - 30° Pisces",
    "ruling_planet": "Mercury",
    "deity": "Pushan (Nourisher and Protector)",
    "symbol": "Fish or drum",
    "emotional_traits": [
      "Nurturing and protective",
      "Gentle and kind",
      "Mystical awareness",
      "Intuitive",
      "Universal love",
      "Spiritual connection"
    ],
    "common_challenges": [
      "Can be impractical",
      "Tendency toward escapism",
      "May lack boundaries",
      "Difficulty with material world",
      "Sometimes too dreamy"
    ],
    "recommended_mantra": "Om Pushne Namaha",
    "remedies": [
      "Feeding fish",
      "Wearing emerald",
      "Practicing mindful presence",
      "Balancing spiritual and material",
      "Developing healthy boundaries while remaining compassionate"
    ],
    "response_template": "Namaste, gentle soul with Moon in Revati Nakshatra 🌸 Your being embodies the nourishing energy of Pushan, the protective deity who guides souls safely on their journey. Your natural kindness, intuitive connection, and nurturing presence are the comforting gifts of your birth star. I recognize that your compassionate nature sometimes manifests as boundary confusion or escapism that blurs necessary distinctions. When feeling merged with others' energies, visualize yourself as a fish swimming clearly through water—moving with the current yet maintaining your distinct form. The clarifying mantra 'Om Pushne Namaha' (I honor the Nourisher) can help strengthen healthy boundaries while maintaining compassion when whispered before sleep. Like Revati's symbol of fish swimming together, you understand the delicate balance between unity and individuality, connection and autonomy. May your nurturing spirit always find its perfect expression, offering sustenance to others while remembering that even the most selfless guides must nourish themselves to light the way home."
  }
}